{
    "books": [
        {
            "_id": "645a2f5b94e4fd26488f1d19",
            "title": "Don Quixote",
            "author": "Miguel de Cervantes",
            "price": 325,
            "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1546112331l/3836.jpg",
            "category": "Adventure",
            "details": "Regarded as one of the greatest works in literature, Don Quixote recounts the adventures of Alonso Quixano: a middle-aged man so obsessed with chivalric books that he decides to imitate them and become a knight-errant. So begins his journey to find a faithful squire, save damsels in distress, and fight windmills.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "6463944a53feeeff2ea53499",
            "title": "Test Book",
            "author": "Kimchi",
            "price": 999,
            "imageURL": "https://images.pexels.com/photos/1170986/pexels-photo-1170986.jpeg?auto=compress&cs=tinysrgb&dpr=1&w=500",
            "category": "Young Adult",
            "details": "This is a test to see if I can add a book to the database.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646489fc442b377ed19fabbe",
            "title": "Test Book 2 with a really long name",
            "author": "Me, Myself and I",
            "price": 666,
            "imageURL": "https://images.unsplash.com/flagged/photo-1557427161-4701a0fa2f42?ixlib=rb-4.0.3&ixid=M3wxMjA3fDB8MHxleHBsb3JlLWZlZWR8MXx8fGVufDB8fHx8fA%3D%3D&auto=format&fit=crop&w=400&q=60",
            "category": "Fantasy",
            "details": "This is a test to see if Add Form works.",
            "featured": true,
            "__v": 0
        },
        {
            "_id": "646b1638f7f64cca3f776d46",
            "title": "The Three Musketeers",
            "author": "Alexandre Dumas",
            "price": 400,
            "imageURL": "https://m.media-amazon.com/images/I/51UJsfRHTRL.jpg",
            "category": "Adventure",
            "details": "In this classic by Dumas, a young man named d’Artagnan joins the Musketeers of the Guard. In doing so, he befriends Athos, Porthos, and Aramis — the King’s most celebrated musketeers — and embarks on a journey of his own.",
            "featured": true,
            "__v": 0
        },
        {
            "_id": "646b6f70f7f64cca3f776d4e",
            "title": " Treasure Island",
            "author": "Robert Louis Stevenson",
            "price": 420,
            "imageURL": "https://m.media-amazon.com/images/I/61Nvv+LTdeL.jpg",
            "category": "Adventure",
            "details": "Written by Scottish author Robert Louis Stevenson, this story of “buccaneers and buried gold” launched a million tropes of treasure maps, sea chests, Black Spots, and deserted islands.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b70bff7f64cca3f776d51",
            "title": "Journey to the Center of the Earth",
            "author": "Jules Verne",
            "price": 440,
            "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1328864746l/1086164.jpg",
            "category": "Adventure",
            "details": "Journey to the Center of the Earth is exactly that: a trip to the inside of the world, which is where German professor Otto Lidenbrock theorizes that volcanic tubes will lead. Another one of Jules Verne’s magnum opuses — and one of the most famous examples of subterranean fiction.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7110f7f64cca3f776d54",
            "title": "The Lost World",
            "author": "Sir Arthur Conan Doyle",
            "price": 450,
            "imageURL": "https://m.media-amazon.com/images/I/51lgsI3h+CL.jpg",
            "category": "Adventure",
            "details": "An expedition to an Amazon basin in South America to find prehistoric dinosaurs goes awry in this 1912 novel by Sir Arthur Doyle. Sherlock Holmes is nowhere to be found, but this book does introduce the notorious character of Professor Challenger, the founder of the mission.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b71c0f7f64cca3f776d56",
            "title": "Moby-Dick",
            "author": "Herman Melville",
            "price": 460,
            "imageURL": "https://m.media-amazon.com/images/I/41ByOqyRTBL.jpg",
            "category": "Adventure",
            "details": "Call me Ishmael, begins this epic story. Acclaimed as one of the greatest books of the sea that’s ever been written, Moby-Dick relates the timeless story of a voyage to hunt and kill the great white whale that rules the ocean and haunts cruel captain Ahab’s mind.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b73fdf7f64cca3f776d58",
            "title": "The Hobbit",
            "author": "J.R.R. Tolkien",
            "price": 300,
            "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1546071216i/5907.jpg",
            "category": "Adventure",
            "details": "In a hole in the ground there lived a hobbit. Not a nasty, dirty, wet hole, filled with the ends of worms and an oozy smell, nor yet a dry, bare, sandy hole with nothing in it to sit down on or to eat: it was a hobbit-hole, and that means comfort. Written for J.R.R. Tolkien’s own children, The Hobbit met with instant critical acclaim when it was first published in 1937. Now recognized as a timeless classic, this introduction to the hobbit Bilbo Baggins, the wizard Gandalf, Gollum, and the spectacular world of Middle-earth recounts of the adventures of a reluctant hero, a powerful and dangerous ring, and the cruel dragon Smaug the Magnificent. The text in this 372-page paperback edition is based on that first published in Great Britain by Collins Modern Classics (1998), and includes a note on the text by Douglas A. Anderson (2001).",
            "featured": true,
            "__v": 0
        },
        {
            "_id": "646b7674f7f64cca3f776d5f",
            "title": "Catch-22",
            "author": "Joseph Heller",
            "price": 330,
            "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1463157317i/168668.jpg",
            "category": "Fiction",
            "details": "Fifty years after its original publication, Catch-22 remains a cornerstone of American literature and one of the funniest—and most celebrated—books of all time. In recent years it has been named to “best novels” lists by Time, Newsweek, the Modern Library, and the London Observer.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b79d9f7f64cca3f776d61",
            "title": "Crime and Punishment",
            "author": "Fyodor Dostoevsky",
            "price": 340,
            "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1382846449i/7144.jpg",
            "category": "Fiction",
            "details": "Raskolnikov, a destitute and desperate former student, wanders through the slums of St Petersburg and commits a random murder without remorse or regret. He imagines himself to be a great man, a Napoleon: acting for a higher purpose beyond conventional moral law. But as he embarks on a dangerous game of cat and mouse with a suspicious police investigator, Raskolnikov is pursued by the growing voice of his conscience and finds the noose of his own guilt tightening around his neck. Only Sonya, a downtrodden sex worker, can offer the chance of redemption.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7a5df7f64cca3f776d65",
            "title": "The Lord of the Rings #1-3",
            "author": "J.R.R. Tolkien",
            "price": 990,
            "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1566425108i/33.jpg",
            "category": "Fiction",
            "details": "In ancient times the Rings of Power were crafted by the Elven-smiths, and Sauron, the Dark Lord, forged the One Ring, filling it with his own power so that he could rule all others. But the One Ring was taken from him, and though he sought it throughout Middle-earth, it remained lost to him. After many ages it fell by chance into the hands of the hobbit Bilbo Baggins.  From Sauron's fastness in the Dark Tower of Mordor, his power spread far and wide. Sauron gathered all the Great Rings to him, but always he searched for the One Ring that would complete his dominion.  When Bilbo reached his eleventy-first birthday he disappeared, bequeathing to his young cousin Frodo the Ruling Ring and a perilous quest: to journey across Middle-earth, deep into the shadow of the Dark Lord, and destroy the Ring by casting it into the Cracks of Doom.  The Lord of the Rings tells of the great quest undertaken by Frodo and the Fellowship of the Ring: Gandalf the Wizard; the hobbits Merry, Pippin, and Sam; Gimli the Dwarf; Legolas the Elf; Boromir of Gondor; and a tall, mysterious stranger called Strider.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7a7df7f64cca3f776d67",
            "title": "To Kill a Mockingbird",
            "author": "Harper Lee",
            "price": 400,
            "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1553383690i/2657.jpg",
            "category": "Fiction",
            "details": "The unforgettable novel of a childhood in a sleepy Southern town and the crisis of conscience that rocked it. \"To Kill A Mockingbird\" became both an instant bestseller and a critical success when it was first published in 1960. It went on to win the Pulitzer Prize in 1961 and was later made into an Academy Award-winning film, also a classic.  Compassionate, dramatic, and deeply moving, \"To Kill A Mockingbird\" takes readers to the roots of human behavior - to innocence and experience, kindness and cruelty, love and hatred, humor and pathos. Now with over 18 million copies in print and translated into forty languages, this regional story by a young Alabama woman claims universal appeal. Harper Lee always considered her book to be a simple love story. Today it is regarded as a masterpiece of American literature.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7aa1f7f64cca3f776d69",
            "title": "Dune #1",
            "author": "Frank Herbert",
            "price": 430,
            "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1555447414i/44767458.jpg",
            "category": "Fiction",
            "details": "Set on the desert planet Arrakis, Dune is the story of the boy Paul Atreides, heir to a noble family tasked with ruling an inhospitable world where the only thing of value is the “spice” melange, a drug capable of extending life and enhancing consciousness. Coveted across the known universe, melange is a prize worth killing for...  When House Atreides is betrayed, the destruction of Paul’s family will set the boy on a journey toward a destiny greater than he could ever have imagined. And as he evolves into the mysterious man known as Muad’Dib, he will bring to fruition humankind’s most ancient and unattainable dream.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7ad7f7f64cca3f776d6b",
            "title": "A Gentleman in Moscow",
            "author": "Amor Towles",
            "price": 500,
            "imageURL": "https://images-na.ssl-images-amazon.com/images/S/compressed.photo.goodreads.com/books/1551480896i/34066798.jpg",
            "category": "Fiction",
            "details": "With his breakout debut novel, Rules of Civility, Amor Towles established himself as a master of absorbing, sophisticated fiction, bringing late 1930s Manhattan to life with splendid atmosphere and a flawless command of style. Readers and critics were enchanted; as NPR commented, “Towles writes with grace and verve about the mores and manners of a society on the cusp of radical change.”  A Gentleman in Moscow immerses us in another elegantly drawn era with the story of Count Alexander Rostov. When, in 1922, he is deemed an unrepentant aristocrat by a Bolshevik tribunal, the count is sentenced to house arrest in the Metropol, a grand hotel across the street from the Kremlin. Rostov, an indomitable man of erudition and wit, has never worked a day in his life, and must now live in an attic room while some of the most tumultuous decades in Russian history are unfolding outside the hotel’s doors. Unexpectedly, his reduced circumstances provide him a doorway into a much larger world of emotional discovery.  Brimming with humour, a glittering cast of characters, and one beautifully rendered scene after another, this singular novel casts a spell as it relates the count’s endeavour to gain a deeper understanding of what it means to be a man of purpose.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7b33f7f64cca3f776d6d",
            "title": "And Then There Were None",
            "author": "Agatha Christie",
            "price": 600,
            "imageURL": "https://m.media-amazon.com/images/I/41l02vDN4pL.jpg",
            "category": "Mystery",
            "details": "It’s impossible to talk about mystery novels without immediately thinking of the legendary Agatha Christie. Amongst all of her works, none has a story quite as impeccably crafted as And Then There Were None, which explains why it is the best selling mystery book of all time.   The story follows ten people who are brought together, for various reasons, to an empty mansion on an island. The mysterious hosts of this strange party are not present, but left instructions for two of the ten to tend the house as the housekeeper and cook. As the days unfold in accordance with the lyrics of a nursery rhyme, each invitee is forced to face the music (literally) and bear the consequences of their troubling pasts, as death will come for them one by one. ",
            "featured": true,
            "__v": 0
        },
        {
            "_id": "646b7b48f7f64cca3f776d6f",
            "title": "The Big Sleep",
            "author": "Raymond Chandler",
            "price": 550,
            "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1371584712l/2052.jpg",
            "category": "Mystery",
            "details": "Raymond Chandler’s idea of mystery strays from conventions — for him it’s less about the intricate plot and more about the atmosphere and characters. As such, The Big Sleep is no ordinary story: private eye Philip Marlowe gets hired to investigate the blackmailing of Carmen Sternwood, the second daughter of a wealthy general. The further he digs into this messy business, the more complicated the story gets, as Carmen continues to be blackmailed by others in a web of unexpected relations between the characters.   Chandler’s work is complex: his characters are multi-faceted and his language rich with premonitions of the tragedy about to fall on this family. While the signs he drops are not exactly there to help you find out “who done it”, it will definitely give you a foreboding awareness that makes it hard to put the book down.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7b65f7f64cca3f776d71",
            "title": "Gone Girl",
            "author": "Gillian Flynn",
            "price": 500,
            "imageURL": "https://m.media-amazon.com/images/I/414FyC8BAuL.jpg",
            "category": "Mystery",
            "details": "Perhaps better known by its major motion picture adaptation, Gone Girl is the ultimate mystery puzzle for the modern media age. Devoted wife Amy’s sudden disappearance throws Nick Dunne into a hailstorm of suspicion — from her parents to his neighbours to the investigators, everyone leans towards believing that he is somehow responsible. Nick himself becomes aware of how his wife viewed him, as well as how little he knows of her, when stories of her emerge from friends he’s never heard of.   Even if you’ve failed to keep the media buzz regarding the movie adaptation from spoiling you, the experience of reading the minds of these unreliable narrators is well-worth picking this one up. ",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7b7bf7f64cca3f776d73",
            "title": "The Postman Always Rings Twice",
            "author": "James M. Cain",
            "price": 490,
            "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1330271399l/591352.jpg",
            "category": "Mystery",
            "details": "The Postman Always Rings Twice is often lauded the most important crime book of the 20th century, and it's not hard to see why. Short, racy, and full of surprises, it will leave you no time to catch your breath. In fact, the language used by Cain was so unprecedentedly explicit, the book was banned in Boston for a while.   The story follows Frank Chambers and his roadside encounter with diner owner Cora Papadakis. Frank ends up working for Cora and her husband and then falling in love with her, despite her marriage. Frank’s spontaneity gets the better of him when he and Cora decide to sinisterly plot for the breakup of her marriage. Once the plan succeeds, they can stay happily ever after in each other’s arms… or so they think. ",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7b91f7f64cca3f776d75",
            "title": "In Cold Blood",
            "author": "Truman Capote",
            "price": 450,
            "imageURL": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1424931136l/168642.jpg",
            "category": "Mystery",
            "details": "https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1424931136l/168642.jpg",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7bb4f7f64cca3f776d77",
            "title": " Woman in White",
            "author": "Wilkie Collins",
            "price": 440,
            "imageURL": "https://m.media-amazon.com/images/I/418byl8zkqL.jpg",
            "category": "Mystery",
            "details": "This Wilkie Collins’s late Victorian novel is among the earliest psychological thrillers ever written. It follows what first appears to be a simple story of two star-crossed lovers — Walter Hartright and Laura Fairlie — who weren’t meant to be together. Laura was betrothed to Sir Percival Glyde and yet she was mysteriously warned not to proceed with the marriage. Meanwhile, the city is gripped by the story of a strange woman clad in white who’s roaming its dark street.  As the title suggests, this final character is the key to the mystery that will enshroud these characters. Set in dimly-lit streets, The Woman in White is as much Gothic horror as it is mystery book, and that’s precisely why the clarity you get when the riddle is solved is so incredibly satisfying. ",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7c78f7f64cca3f776d79",
            "title": "The Hitchhiker's Guide to the Galaxy",
            "author": "Douglas Adams",
            "price": 600,
            "imageURL": "https://ik.imagekit.io/panmac/tr:f-auto,di-placeholder_portrait_aMjPtD9YZ.jpg,w-171/edition/9781529034523.jpg",
            "category": "Science Fiction",
            "details": "The Hitchhiker's Guide to the Galaxy began life as a Radio 4 show in 1978 and has since spawned adaptations across almost every format, making it a staple on every respectable list of the best sci-fi books. Following the galactic adventures of Arthur Dent after his house's untimely demolition to make way for a new hyperspace express route, this new edition of 'The Guide' features exclusive bonus archive material and a new introduction from Russell T. Davies. This classic science fiction novel is a must-read for fans of the genre. ",
            "featured": true,
            "__v": 0
        },
        {
            "_id": "646b7c9ef7f64cca3f776d7b",
            "title": "The Invisible Man",
            "author": "H. G. Wells",
            "price": 550,
            "imageURL": "https://ik.imagekit.io/panmac/tr:f-auto,di-placeholder_portrait_aMjPtD9YZ.jpg,w-171/edition/9781529069051.jpg",
            "category": "Science Fiction",
            "details": "An absolute classic of early science fiction, H.G. Wells' The Invisible Man blends high tension with sharp wit and fear. A stranger arrives at a rustic Sussex inn on a chill wintery night, his face wrapped in bandages and his body enveloped in a heavy coat. Locked away in his room, the man mixes chemicals in elaborate glass bottles. His secret? The man is invisible, a scientist desperately trying to find a cure for his unhappy, perilous fate. ",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7cbef7f64cca3f776d7d",
            "title": "Exhalation",
            "author": "Ted Chiang",
            "price": 500,
            "imageURL": "https://ik.imagekit.io/panmac/tr:f-auto,di-placeholder_portrait_aMjPtD9YZ.jpg,w-171/edition/9781529014495.jpg",
            "category": "Science Fiction",
            "details": "Named in Barack Obama's 2019 summer reading list, this groundbreaking collection of science fiction short stories is the second from acclaimed author Ted Chiang. In these nine stunningly original and poignant stories, we encounter a portal through time in ancient Baghdad, a scientist who makes a shocking discovery that will affect all of humanity and a woman who cares for an AI ‘pet’ for over twenty years. Addressing, among others, essential questions around the nature of the universe and what it means to be human, this is science fiction writing at its most thoughtful.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7cdaf7f64cca3f776d7f",
            "title": "To Sleep in a Sea of Stars",
            "author": "Christopher Paolini",
            "price": 490,
            "imageURL": "https://ik.imagekit.io/panmac/tr:f-auto,di-placeholder_portrait_aMjPtD9YZ.jpg,w-171/edition/9781529046526.jpg",
            "category": "Science Fiction",
            "details": "To Sleep in a Sea of Stars is the masterful epic science fiction novel from New York Times and Sunday Times bestselling author, Christopher Paolini. The novel follows xenobiologist Kira Navárez as she discovers an alien relic that thrusts her into the wonders and nightmares of first contact. Epic space battles for the fate of humanity ensue, taking her to the farthest reaches of the galaxy and, in the process, transform not only her – but the entire course of history.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7cf6f7f64cca3f776d81",
            "title": "The Time Machine",
            "author": "H. G. Wells",
            "price": 440,
            "imageURL": "https://ik.imagekit.io/panmac/tr:f-auto,di-placeholder_portrait_aMjPtD9YZ.jpg,w-171/edition/9781909621534.jpg",
            "category": "Science Fiction",
            "details": "H. G. Wells was among the first to express a plausible scientific method of time travel, and he also coined the term ‘time machine’ in this science fiction novella. The book has been adapted into three different films, and still influences science fiction writers today. The Time Machine is a pioneering classic that is considered by many to be the most influential sci-fi book of all time.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7d22f7f64cca3f776d83",
            "title": "Frankenstein",
            "author": "Mary Shelley",
            "price": 610,
            "imageURL": "https://ik.imagekit.io/panmac/tr:f-auto,di-placeholder_portrait_aMjPtD9YZ.jpg,w-171/edition/9781509827756.jpg",
            "category": "Science Fiction",
            "details": "Mary Shelley's story of a man who creates a monster he cannot control was a precursor of modern science fiction and a must-read for any sci-fi fans wanting to understand the history of the genre. Victor Frankenstein, a brilliant but wayward scientist, builds a human from dead flesh. Horrified at what he has done, he abandons his creation. The hideous creature learns language and becomes civilized but society rejects him. Spurned, he seeks vengeance on his creator. ",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7d83f7f64cca3f776d85",
            "title": "A Court of Thorns",
            "author": "Sarah J. Maas",
            "price": 600,
            "imageURL": "https://m.media-amazon.com/images/I/51FaoP3MfML.jpg",
            "category": "Young Adult",
            "details": "From the author of Throne of Glass comes this equally intense and thrilling young adult book series, devised as a loose retelling of Beauty and the Beast. In the eponymous first installment, now a new adult favorite, a young human huntress named Feyre is captured and forced to become the ward of a part-faerie, part-beast High Lord called Tamlin. Though cold to one another at first, Feyre’s irrepressible human spirit and curiosity soon endear her to Tamlin, and their lives intertwine as she learns the ways of the fae. But this contentment is shattered when Feyre realizes the curse that hangs over Tamlin and his people… and finally understands that only she has the power to save them",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7da1f7f64cca3f776d87",
            "title": "A Separate Peace",
            "author": "John Knowles",
            "price": 550,
            "imageURL": "https://m.media-amazon.com/images/I/51L1V9iIB7L.jpg",
            "category": "Young Adult",
            "details": "One of the most quietly impactful young adult books you’ll find on an AP English reading list, A Separate Peace centers on a complicated friendship between two adolescent boys. Gene and Finny are roommates at the quintessentially northeastern Devon School, where they become thick as thieves despite their very different personalities. But as the shy, unathletic Gene grows jealous of Finny’s easy confidence, he’s driven to do something unforgivable — after which their lives will ever be the same. Set against the sobering backdrop of WWII, A Separate Peace makes universal themes of loyalty and loss of innocence seem incredibly personal, and ensures this story is one the reader will never forget.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7db9f7f64cca3f776d89",
            "title": "A Series of Unfortunate Events",
            "author": "Lemony Snicket",
            "price": 400,
            "imageURL": "https://m.media-amazon.com/images/I/51qn1175UaL.jpg",
            "category": "Young Adult",
            "details": "No one can balance absurdity and tragedy quite like Lemony Snicket. His talents are on full display in A Series of Unfortunate Events, thirteen unrelentingly dark yet deliciously readable young adult books about the luckless Baudelaire children. Their troubles begin with their parents’ deaths and their adoption by Count Olaf, the notorious (albeit ridiculous) villain of the series who assumes a new identity in each book — all in pursuit of the Baudelaires’ vast fortune, which always seems just out of reach.  This is the one shred of luck the children do have, as they’re repeatedly forced into miserable situations with various odd caretakers, and have little success uncovering the secrets behind their parents’ deaths (and the mysterious organization, V.F.D., to which they belonged). It can certainly be frustrating, especially for young readers, to see them thwarted at every turn. Still, this young adult book series is more than worth it for the intrigue, excitement, and thought-provoking ideas about morality and “good vs. evil,” especially as these teenage books progress into more sophisticated territory.",
            "featured": false,
            "__v": 0
        },
        {
            "_id": "646b7e06f7f64cca3f776d8b",
            "title": "City of Bones",
            "author": "Cassandra Clare",
            "price": 610,
            "imageURL": "https://m.media-amazon.com/images/I/512qJxcvPzL.jpg",
            "category": "Young Adult",
            "details": "Like many books for teen girls, this novel has two things about it that are undeniably true: it’s wildly popular, and people either love it or hate it. So make no mistake, you’re going to have strong feelings about this book.  For anyone who doesn’t know, City of Bones is part of the Shadowhunters universe, a multi-series fantasy saga that encompasses (to date) fifteen novels across four young adult book series, three volumes of related short stories, four graphic novels, as well as the requisite movie and TV show adaptations — with plenty more still to come.  This first book follows Clary: a seemingly ordinary girl in New York City whose life is turned upside-down when she stumbles upon the world of the Shadowhunters, humans with angel blood who are tasked with keeping the world safe from demons and other magical beings. It’s an exciting introduction to an enormous urban fantasy world, full of action, adventure, and romance, and has become an important part of many teenagers’ reading histories since its release in 2007.",
            "featured": true,
            "__v": 0
        }
    ]
}
